Autodesk.Revit.DB.SharedParameterApplicableRule.ParameterName
The name of the parameter that an element must support to pass this rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SharedParameterApplicableRule.#ctor(System.String)
Constructs an instance of SharedParameterApplicableRule.
parameterName:
The name of the parameter that an element must support to pass this rule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.SharedParameterApplicableRule
Tests whether an element supports a shared parameter.
Since:
2011